# RemoveTemperatureRatingType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireMaterialType..::..RemoveTemperatureRatingType Method
WireMaterialType Class See Also
---
Remove an existing temperature rating type from this material type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RemoveTemperatureRatingType(
	TemperatureRatingType temperatureRating
)
```

Visual Basic
---
```text
Public Sub RemoveTemperatureRatingType ( _
	temperatureRating As TemperatureRatingType _
)
```

Visual C++
---
```text
public:
void RemoveTemperatureRatingType(
	TemperatureRatingType^ temperatureRating
)
```

# ### Parameters
temperatureRating
    Type: Autodesk.Revit.DB.Electrical..::..TemperatureRatingTypeThe temperature rating type to be removed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The last temperature rating type of project and any one used by a wire type can't be removed. |

# See Also
WireMaterialType Class
Autodesk.Revit.DB.Electrical Namespace